import unittest
from parameterized import parameterized
from Collections.unique_names import get_unique_names


class TestSuperTeacher(unittest.TestCase):
    @parameterized.expand(
        [
            (
                "test_1",
                [
                    [
                        "Евгений Шмаргунов",
                        "Олег Булыгин",
                        "Дмитрий Демидов",
                        "Кирилл Табельский",
                        "Александр Ульянцев",
                    ],
                    [
                        "Филипп Воронов",
                        "Анна Юшина",
                        "Иван Бочаров",
                        "Анатолий Корсаков",
                        "Юрий Пеньков",
                        "Илья Сухачев",
                    ],
                ],
                "Уникальные имена преподавателей: Александр, Анатолий, Анна, Дмитрий, Евгений, Иван, Илья, Кирилл, Олег, Филипп, Юрий.",
            ),
            (
                "test_2",
                [
                    [
                        "Евгений Шмаргунов",
                        "Олег Булыгин",
                        "Владимир Чебукин",
                        "Эдгар Нуруллин",
                        "Евгений Шек",
                        "Максим Филипенко",
                        "Елена Никитина",
                    ],
                    [
                        "Владимир Чебукин",
                        "Эдгар Нуруллин",
                        "Евгений Шек",
                        "Николай Лопин",
                        "Михаил Ларченко",
                    ],
                ],
                "Уникальные имена преподавателей: Владимир, Евгений, Елена, Максим, Михаил, Николай, Олег, Эдгар.",
            ),
        ]
    )
    def test_super_teachers(self, name, mentors, expected):
        result = get_unique_names(mentors)
        self.assertEqual(result, expected)
